package com.example.demo.algorithm.year25.month12;

public class Day03 {
    public static void main(String[] args) {

    }

    /*
    85. 最大矩形
    给定一个仅包含 0 和 1 、大小为 rows x cols 的二维二进制矩阵，找出只包含 1 的最大矩形，并返回其面积。
    
    示例 1：
    输入：matrix = [
    ["1","0","1","0","0"],
    ["1","0","1","1","1"],
    ["1","1","1","1","1"],
    ["1","0","0","1","0"]
    ]
    输出：6
    解释：最大矩形如上图所示。
    
    示例 2：
    输入：matrix = []
    输出：0
    
    示例 3：
    输入：matrix = [["0"]]
    输出：0
    
    示例 4：
    输入：matrix = [["1"]]
    输出：1
    
    示例 5：
    输入：matrix = [["0","0"]]
    输出：0
    
    提示：
    rows == matrix.length
    cols == matrix[0].length
    1 <= row, cols <= 200
    matrix[i][j] 为 '0' 或 '1'

    直接记录每个点位的最大的面积，后面的节点看到当前的大小并不知道前面具体是什么形状
    我的想法是每当到一个新的点，分别向他的左，上，左上分别看下他们是不是矩形，如果是矩形，对比他们记录的矩形形状看能否把这个节点加入，如果可以直接加一，如果不行
     */
}
